app/controllers/resorts_controller.rb

SELECT "resorts".* FROM "resorts"
---
  def index
    @resorts = Resort.all

SELECT "resorts".* FROM "resorts" WHERE ("resorts"."id" = 1) LIMIT 1
---
  def show
    @resort = Resort.find(params[:id])

SELECT "resorts".* FROM "resorts" WHERE ("resorts"."id" = 1) LIMIT 1
---
  def edit
    @resort = Resort.find(params[:id])

INSERT INTO "resorts" ("name", "season_start", "season_end", "green_runs", "blue_runs", "red_runs", "black_runs", "single_diamond_runs", "double_diamond_runs", "triple_diamond_runs", "other_runs", "carpet_lifts", "drag_lifts", "pommer_lifts", "chair_lifts", "covered_chair_lifts", "express_chair_lifts", "gondola_lifts", "other_lifts", "terrain_parks", "snow_making", "average_snow_cm", "created_at", "updated_at", "altitude_m", "altitude_ft", "total_runs", "piste_map_link", "official_site_link", "tourism_board_link", "total_lifts") VALUES ('La Plagne', '2011-01-31 08:28:00.000000', '2011-01-31 08:28:00.000000', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 61, NULL, 26, NULL, 5, NULL, NULL, NULL, 'f', NULL, '2011-01-31 08:46:21.377462', '2011-01-31 08:46:21.377462', 3250, NULL, NULL, '', 'www.la-plagne.com', '', 106)
---
  def create
    @resort = Resort.new(params[:resort])

    respond_to do |format|
      if @resort.save

SELECT "resorts".* FROM "resorts" WHERE ("resorts"."id" = 1) LIMIT 1
---
  def update
    @resort = Resort.find(params[:id])

SELECT "resorts".* FROM "resorts" WHERE ("resorts"."id" = 2) LIMIT 1
DELETE FROM "resorts" WHERE ("resorts"."id" = 2)
---
  def destroy
    @resort = Resort.find(params[:id])
    @resort.destroy